import menu
import players
import utils
import xprint

# ПЕРВЫЙ ЗАПУСК
TITLE = 'Крестики-Нолики'
HELP = menu.options
xprint._message(TITLE)
print('version 0.0.2')
xprint._table(HELP)

# ИГРОКИ
PLAYERS = players._read() 

name_01 = input('Введите имя игрока 1: > ')
print()
if name_01 not in PLAYERS:
    players._create(name_01)

xprint._table([('ОДИНОЧНАЯ ИГРА', 1), ('ИГРА С СОПЕРНИКОМ', 2)])
game_mod = input('Выберете режим игры: > ')
print()
if game_mod == '1':
    xprint._table([('ПРОСТО', 1), ('СЛОЖНО', 2)])
    difficulty = input('Выберете уровень сложности: > ')
    print()
    if difficulty == '1':
        name_02 = 'BOTEASY'
    else:
        name_02 = 'BOTHARD'
else:
    name_02 = input('Введите имя игрока 2: > ')
    print()

if name_02 not in PLAYERS:
    players._create(name_02)

PLAYERS = players._read() 
names = [name_01, name_02]

xprint._table([('Играть X', 1), ('Играть O', 2)]) 
player_01_token = input('Выберете за кого играть: > ')   
if player_01_token == '2':
    names.reverse()

print(names)

# ПРОЦЕСС ИГРЫ
SIZE = 3
isWIN = utils._wincheck
isDRAW = utils._drawcheck
ADDSTEP = utils._addstep
TOKENS = ('O', 'X')
CMD = input('КОМАНДА МЕНЮ: > ')

while True:
    if CMD == 'dim':
        SIZE = menu._dim()
    if CMD == 'new':
        TURNS = [' ' for _ in range(SIZE**2)]
        STEPS = []
        WINS = utils._wins(SIZE)
        STROUT = xprint._template(SIZE)
        print(STROUT.format(*TURNS))
        while True:
            STEP = int(input(f'Ход {names[len(STEPS) % 2]}: > '))
            try:
                # ХОД
                ADDSTEP(STEP, STEPS, SIZE)
                TURNS[STEP - 1] = TOKENS[len(STEPS)%2]
                # ВЫВОД ПОЛЯ
                print(STROUT.format(*TURNS))
                
                # НИЧЬЯ
                if isDRAW(STEPS, WINS):
                    # ОБНОВЛЕНИЕ ДАННЫХ
                    players._update(name_01, 'draws', str(int(PLAYERS[name_01]['draws']) + 1))
                    players._update(name_02, 'draws', str(int(PLAYERS[name_02]['draws']) + 1))
                    xprint._message(f'The game ended in a draw...')
                    break
                
                # ПОБЕДА
                if isWIN(STEPS, WINS):
                    # ОБНОВЛЕНИЕ ДАННЫХ
                    winner = names[len(STEPS) % 2 - 1]
                    loser = names[len(STEPS) % 2]
                    players._update(winner, 'wins', str(int(PLAYERS[winner]['wins']) + 1))
                    players._update(loser, 'loses', str(int(PLAYERS[loser]['loses']) + 1))
                    xprint._message(f'Congratulations winner - {winner} !!!')
                    break
                    
            except:
                break
                # print('Вы ввели не число')
                # continue
    if CMD == 'player':
        xprint._message('СМЕНИТЬ ИГРОКА')
    if CMD == 'table':
        xprint._message('ТАБЛИЦА РЕЗУЛЬТАТОВ')
    if CMD == 'quit':
        break
    
    CMD = input('КОМАНДА МЕНЮ: > ')
xprint._message('ИГРА ЗАКОНЧЕНА!')

# 13:09:46 > python -i temp.py
#==========================================================================================================================#
#                                                                                                                          #
#                                                     Крестики-Нолики                                                      #
#                                                                                                                          #
#==========================================================================================================================#
# version 0.0.2
#==========================================================================================================================#
#                                                                                                                          #
#     начать новую партию                  | new     | n  | начать    | н                                                  #
#     загрузить существующую партию        | load    | l  | загрузка  | з                                                  #
#     отобразить раздел помощи             | help    | h  | помощь    | п                                                  #
#     создать или переключиться на игрока  | player  | p  | игрок     | и                                                  #
#     отобразить таблицу результатов       | table   | t  | таблица   | т                                                  #
#     изменить размер поля                 | dim     | d  | размер    | р                                                  #
#     выйти                                | quit    | q  | выход     | в                                                  #
#                                                                                                                          #
#==========================================================================================================================#

# Введите имя игрока 1: > USER

#==========================================================================================================================#
#                                                                                                                          #
#     ОДИНОЧНАЯ ИГРА     | 1                                                                                               #
#     ИГРА С СОПЕРНИКОМ  | 2                                                                                               #
#                                                                                                                          #
#==========================================================================================================================#

# Выберете режим игры: > 1

#==========================================================================================================================#
#                                                                                                                          #
#     ПРОСТО  | 1                                                                                                          #
#     СЛОЖНО  | 2                                                                                                          #
#                                                                                                                          #
#==========================================================================================================================#

# Выберете уровень сложности: > 1

#==========================================================================================================================#
#                                                                                                                          #
#     Играть X  | 1                                                                                                        #
#     Играть O  | 0                                                                                                        #
#                                                                                                                          #
#==========================================================================================================================#

# Выберете за кого играть: > 0
# ['BOTEASY', 'USER']
# КОМАНДА МЕНЮ: > dim
# Введите размер поля: 4
# КОМАНДА МЕНЮ: > new
#    |   |   |
# ————————————————
#    |   |   |
# ————————————————
#    |   |   |
# ————————————————
#    |   |   |

# Ход BOTEASY: > 6
#    |   |   |
# ————————————————
#    | X |   |
# ————————————————
#    |   |   |
# ————————————————
#    |   |   |

# Игра продолжается...
# Ход USER: > 7
#    |   |   |
# ————————————————
#    | X | O |
# ————————————————
#    |   |   |
# ————————————————
#    |   |   |

# Игра продолжается...
# Ход BOTEASY: > 11
#    |   |   |
# ————————————————
#    | X | O |
# ————————————————
#    |   | X |
# ————————————————
#    |   |   |

# Игра продолжается...
# Ход USER: > 10
#    |   |   |
# ————————————————
#    | X | O |
# ————————————————
#    | O | X |
# ————————————————
#    |   |   |

# Игра продолжается...
# Ход BOTEASY: > 4
#    |   |   | X
# ————————————————
#    | X | O |
# ————————————————
#    | O | X |
# ————————————————
#    |   |   |

# Игра продолжается...
# Ход USER: > 16
#    |   |   | X
# ————————————————
#    | X | O |
# ————————————————
#    | O | X |
# ————————————————
#    |   |   | O

# Игра продолжается...
# Ход BOTEASY: > 13
#    |   |   | X
# ————————————————
#    | X | O |
# ————————————————
#    | O | X |
# ————————————————
#  X |   |   | O

# Игра продолжается...
# Ход USER: > 1
#  O |   |   | X
# ————————————————
#    | X | O |
# ————————————————
#    | O | X |
# ————————————————
#  X |   |   | O

#==========================================================================================================================#
#                                                                                                                          #
#                                               The game ended in a draw...                                                #
#                                                                                                                          #
#==========================================================================================================================#
# КОМАНДА МЕНЮ: > quit
#==========================================================================================================================#
#                                                                                                                          #
#                                                     ИГРА ЗАКОНЧЕНА!                                                      #
#                                                                                                                          #
#==========================================================================================================================#



# Ход BOTEASY: > 100
#  X | X | X | X | X | X | X | X | X | O
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  O |   |   |   |   |   |   |   |   | X
# ————————————————————————————————————————
#  X | O | O | O | O | O | O | O | O | O

#==========================================#
#                                          #
#       The game ended in a draw...        #
#                                          #
#==========================================#